Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# Tip.0018.Body
source: Press ⌥⌘B to step back in time in a terminal window. Use arrow keys to go frame by frame. Hold ⇧ and press arrow keys to go faster.
de: Drücken Sie ⌥⌘B, um in einem Terminalfenster in der Zeit zurückzugehen. Verwenden Sie die Pfeiltasten, um Bild für Bild vorzugehen. Halten Sie ⇧ gedrückt und drücken Sie die Pfeiltasten, um schneller voranzukommen.
ja: ⌥⌘Bを押すと、ターミナルウィンドウの時間をさかのぼれます。矢印キーでフレームごとに移動できます。⇧を押しながら矢印キーを押すと、より速く移動できます。
pt_br: Pressione ⌥⌘B para voltar no tempo em uma janela de terminal. Use as teclas de seta para avançar quadro a quadro. Mantenha ⇧ pressionada e use as teclas de seta para ir mais rápido.
ru: Нажмите ⌥⌘B, чтобы вернуться назад во времени в окне терминала. Используйте клавиши со стрелками для перехода по кадрам. Удерживайте ⇧ и нажимайте стрелки, чтобы двигаться быстрее.
zh_hans: 按⌥⌘B可在终端窗口中倒带回到过去。使用箭头键逐帧移动。按住⇧并按箭头键可加快速度。

# Tip.0018.Title
source: Instant Replay
de: Sofortwiedergabe
ja: インスタントリプレイ
ru: Мгновенный повтор
zh_hans: 即时回放

# Tip.0019.Body
source: You can have a terminal window open with a keystroke, even while in other apps. Click “Create a Dedicated Hotkey Window” in “Settings > Keys.”
de: Sie können ein Terminalfenster per Tastendruck öffnen, selbst wenn Sie sich in einer anderen App befinden. Klicken Sie auf „Eigenes Hotkey-Fenster erstellen“ unter „Einstellungen > Tasten“.
ja: 他のアプリを使用中でも、キー操作1つでターミナルウィンドウを開けます。「設定 > キー」で「専用ホットキーウィンドウを作成」をクリックしてください。
pt_br: Você pode abrir uma janela de terminal com um atalho de teclado, mesmo em outros apps. Clique em “Criar uma janela de tecla de atalho dedicada” em “Ajustes > Teclas”.
ru: Вы можете открывать окно терминала одним нажатием клавиши, даже находясь в других приложениях. Нажмите «Создать выделенное окно горячих клавиш» в «Настройки > Клавиши».
zh_hans: 即使在其他应用程序中，也可以通过按键操作打开终端窗口。在“设置 > 快捷键”中点击“创建专用快捷键窗口”。

# Tip.0019.Title
source: Hotkey Window
de: Hotkey-Fenster
ja: ホットキーウィンドウ
pt_br: Janela de tecla de atalho
ru: Окно горячих клавиш
zh_hans: 快捷键窗口

# Tip.0020.Body
source: Hotkey windows can stay open after losing focus. Turn it on in “Window > Pin Hotkey Window.”
de: Hotkey-Fenster können geöffnet bleiben, auch wenn sie den Fokus verlieren. Aktivieren Sie dies unter „Fenster > Hotkey-Fenster anheften“.
ja: ホットキーウィンドウは、フォーカスを失った後も開いたままにできます。「ウィンドウ > ホットキーウィンドウを固定」でオンにしてください。
pt_br: As janelas de tecla de atalho podem permanecer abertas após perder o foco. Ative em “Janela > Fixar janela de tecla de atalho”.
ru: Окна горячих клавиш могут оставаться открытыми после потери фокуса. Включите это в «Окно > Закрепить окно горячих клавиш».
zh_hans: 失去焦点后，快捷键窗口仍可以保持打开状态。在“窗口 > 固定快捷键窗口”中开启此功能。

# Tip.0020.Title
source: Hotkey Window
de: Hotkey-Fenster
ja: ホットキーウィンドウ
pt_br: Janela de tecla de atalho
ru: Окно горячих клавиш
zh_hans: 热键窗口

# Tip.0021.Body
source: The cursor guide is a horizontal line that follows your cursor. You can turn it on in “Settings > Profiles > Colors” or toggle it with the ⌥⌘; shortcut.
de: Die Cursor-Führungslinie ist eine horizontale Linie, die Ihrem Cursor folgt. Sie können sie unter „Einstellungen > Profile > Farben“ aktivieren oder mit der Tastenkombination ⌥⌘; umschalten.
ja: カーソルガイドは、カーソルに追従する水平線です。「設定 > プロファイル > カラー」でオンにするか、⌥⌘;のショートカットで切り替えられます。
pt_br: A guia do cursor é uma linha horizontal que acompanha o seu cursor. Você pode ativá-la em “Ajustes > Perfis > Cores” ou alterná-la com o atalho ⌥⌘;.
ru: Направляющая курсора представляет собой горизонтальную линию, которая следует за курсором. Её можно включить в «Настройки > Профили > Цвета» или переключить сочетанием клавиш ⌥⌘;.
zh_hans: 光标引导线是一个跟随 cursor 的水平线。你可以在“设置 > 配置文件 > 颜色”中开启它，或使用 ⌥⌘ 快捷键切换。

# Tip.0021.Title
source: Cursor Guide
de: Cursor-Führungslinie
ja: カーソルガイド
pt_br: Guia do cursor
ru: Направляющая курсора
zh_hans: 光标引导线

# Tip.0022.Body
source: The Shell Integration feature lets you ask to be alerted (⌥⌘A) when a long-running command completes.
de: Mit der Shell-Integration können Sie sich benachrichtigen lassen (⌥⌘A), wenn ein lange laufender Befehl abgeschlossen ist.
ja: シェル統合機能を使うと、長時間実行しているコマンドが完了したときにアラートを受け取るよう設定できます(⌥⌘A)。
pt_br: O recurso Shell Integration permite pedir para ser alertado (⌥⌘A) quando um comando demorado termina.
ru: Функция «Интеграция с оболочкой» позволяет получать оповещение (⌥⌘A) о завершении долго выполняющейся команды.
zh_hans: Shell 集成功能允许你在长时间运行的命令完成时收到提醒（⌥⌘A）。

# Tip.0022.Title
source: Shell Integration: Alerts
de: Shell-Integration: Benachrichtigungen
ja: シェル統合: アラート
pt_br: Shell Integration: alertas
ru: Интеграция с оболочкой: оповещения
zh_hans: Shell 集成：提醒

# Tip.0023.Body
source: You can configure how quickly the cursor blinks in “Settings > Advanced.”
de: Sie können unter „Einstellungen > Erweitert“ festlegen, wie schnell der Cursor blinkt.
ja: 「設定 > 詳細」で、カーソルの点滅速度を設定できます。
pt_br: Você pode configurar a velocidade de piscar do cursor em “Ajustes > Avançado”.
ru: Скорость мигания курсора можно настроить в «Настройки > Дополнительные».
zh_hans: 您可以在“设置 > 高级”中配置光标闪烁的速度。

# Tip.0024.Body
source: The Shell Integration feature lets you navigate among shell prompts with ⇧⌘↑ and ⇧⌘↓.
de: Mit der Shell-Integration können Sie mit ⇧⌘↑ und ⇧⌘↓ zwischen den Shell-Eingabeaufforderungen navigieren.
ja: シェル統合機能を使うと、⇧⌘↑と⇧⌘↓でシェルプロンプト間を移動できます。
pt_br: O recurso Shell Integration permite navegar entre os prompts do shell com ⇧⌘↑ e ⇧⌘↓.
ru: Функция «Интеграция с оболочкой» позволяет перемещаться между приглашениями оболочки с помощью ⇧⌘↑ и ⇧⌘↓.
zh_hans: Shell集成功能允许您使用 ⇧⌘↑ 和 ⇧⌘↓ 在shell提示符之间导航。

# Tip.0025.Body
source: The Shell Integration feature puts a blue arrow next to your shell prompt. If you run a command that fails, it turns red. Right click on it to get the running time and status.
de: Die Shell-Integration zeigt einen blauen Pfeil neben Ihrer Shell-Eingabeaufforderung an. Wenn ein ausgeführter Befehl fehlschlägt, wird er rot. Klicken Sie mit der rechten Maustaste darauf, um Laufzeit und Status zu erfahren.
ja: シェル統合機能は、シェルプロンプトの横に青い矢印を表示します。実行したコマンドが失敗すると、矢印は赤くなります。右クリックすると、実行時間とステータスを確認できます。
pt_br: O recurso Shell Integration coloca uma seta azul ao lado do seu prompt do shell. Se você executar um comando que falha, ela fica vermelha. Clique nela com o botão direito para ver o tempo de execução e o status.
ru: Функция «Интеграция с оболочкой» отображает синюю стрелку рядом с приглашением оболочки. Если выполненная команда завершается ошибкой, стрелка становится красной. Щёлкните по ней правой кнопкой мыши, чтобы узнать время выполнения и статус.
zh_hans: Shell集成功能会在您的shell提示符旁添加蓝色箭头。如果运行的命令失败，它会变为红色。点击右键可查看运行时间和状态。

# Tip.0026.Body
source: With Shell Integration installed, you can select the output of the last command with ⇧⌘A.
de: Mit installierter Shell-Integration können Sie die Ausgabe des letzten Befehls mit ⇧⌘A auswählen.
ja: シェル統合をインストールしていれば、⇧⌘Aで直前のコマンドの出力を選択できます。
pt_br: Com a Shell Integration instalada, você pode selecionar a saída do último comando com ⇧⌘A.
ru: Если установлена «Интеграция с оболочкой», вы можете выделить вывод последней команды с помощью ⇧⌘A.
zh_hans: 安装 Shell Integration 后，可以使用 ⇧⌘A 选择上一个命令的输出内容。

# Tip.0026.Title
source: Shell Integration: Selection
de: Shell-Integration: Auswahl
ja: シェル統合: 選択
pt_br: Shell Integration: seleção
ru: Интеграция с оболочкой: выделение
zh_hans: Shell Integration：选择操作

# Tip.0027.Body
source: The dock icon shows a count of the number of bells rung and notifications posted since the app was last active.
de: Das Dock-Symbol zeigt die Anzahl der Signaltöne und Benachrichtigungen an, die seit der letzten Aktivität der App aufgetreten sind.
ja: Dockアイコンには、アプリが最後にアクティブだった時から鳴ったベルの回数と、投稿された通知の数が表示されます。
pt_br: O ícone no Dock mostra a contagem de campainhas tocadas e notificações publicadas desde a última vez que o app esteve ativo.
ru: Значок в доке показывает количество поданных звуковых сигналов и полученных уведомлений с момента последней активности приложения.
zh_hans: 栏架图标会显示自上次应用运行时已发出的铃声次数和通知数量。

# Tip.0027.Title
source: Bells
de: Signaltöne
ja: ベル
pt_br: Campainhas
ru: Звуковые сигналы
zh_hans: 铃声

# Tip.0028.Body
source: If you install Shell Integration on a machine you ssh to, you can right click on a filename (for example, in the output of “ls”) and choose “Download with scp” to download the file.
de: Wenn Sie die Shell-Integration auf einem Rechner installieren, mit dem Sie sich per ssh verbinden, können Sie mit der rechten Maustaste auf einen Dateinamen klicken (zum Beispiel in der Ausgabe von „ls“) und „Mit scp herunterladen“ wählen, um die Datei herunterzuladen.
ja: sshで接続するマシンにシェル統合をインストールしておけば、(たとえば「ls」の出力の中で)ファイル名を右クリックして「scpでダウンロード」を選び、ファイルをダウンロードできます。
pt_br: Se você instalar a Shell Integration em uma máquina à qual se conecta por ssh, poderá clicar com o botão direito em um nome de arquivo (por exemplo, na saída do “ls”) e escolher “Transferir com scp” para transferir o arquivo.
ru: Если вы установите «Интеграцию с оболочкой» на компьютере, к которому подключаетесь по ssh, вы можете щёлкнуть правой кнопкой мыши по имени файла (например, в выводе команды «ls») и выбрать «Скачать по scp», чтобы загрузить файл.
zh_hans: 如果您在通过 SSH 连接的机器上安装 Shell Integration，可以右键点击文件名（例如“ls”的输出结果中的文件），选择“Download with scp”以下载该文件。

# Tip.0029.Body
source: Press ⌘/ to locate your cursor. It’s fun!
de: Drücken Sie ⌘/, um Ihren Cursor zu finden. Das macht Spaß!
ja: ⌘/を押すとカーソルの位置がわかります。楽しいですよ!
pt_br: Pressione ⌘/ para localizar seu cursor. É divertido!
ru: Нажмите ⌘/, чтобы найти курсор. Это забавно!
zh_hans: 按 ⌘/ 键定位光标。很有趣！

# Tip.0029.Title
source: Find Your Cursor
de: Cursor finden
ja: カーソルを探す
pt_br: Encontrar o cursor
ru: Найти курсор
zh_hans: 找到您的光标

# Tip.0030.Body
source: You can edit Smart Selection regular expressions in “Settings > Profiles > Advanced > Smart Selection.”
de: Sie können die regulären Ausdrücke der Intelligenten Auswahl unter „Einstellungen > Profile > Erweitert > Intelligente Auswahl“ bearbeiten.
ja: 「設定 > プロファイル > 詳細 > スマート選択」で、スマート選択の正規表現を編集できます。
pt_br: Você pode editar as expressões regulares da Seleção inteligente em “Ajustes > Perfis > Avançado > Seleção inteligente”.
ru: Регулярные выражения умного выделения можно редактировать в «Настройки > Профили > Дополнительные > Умное выделение».
zh_hans: 您可以在“Settings > Profiles > Advanced > Smart Selection”中编辑智能选取的正则表达式。

# Tip.0030.Title
source: Customize Smart Selection
de: Intelligente Auswahl anpassen
ja: スマート選択のカスタマイズ
pt_br: Personalizar a seleção inteligente
ru: Настройка умного выделения
zh_hans: 自定义智能选取功能

# Tip.0031.Body
source: Assign an action to a Smart Selection rule in “Settings > Profiles > Advanced > Smart Selection > Edit Actions.” They go in the context menu and override semantic history on ⌘-click.
de: Weisen Sie einer Regel der Intelligenten Auswahl unter „Einstellungen > Profile > Erweitert > Intelligente Auswahl > Aktionen bearbeiten“ eine Aktion zu. Diese erscheinen im Kontextmenü und überschreiben den Semantischen Verlauf beim ⌘-Klick.
ja: 「設定 > プロファイル > 詳細 > スマート選択 > アクションを編集」で、スマート選択のルールにアクションを割り当てられます。アクションはコンテキストメニューに表示され、⌘クリック時にはセマンティックヒストリーより優先されます。
pt_br: Atribua uma ação a uma regra de Seleção inteligente em “Ajustes > Perfis > Avançado > Seleção inteligente > Editar ações”. Elas vão para o menu de contexto e substituem o Semantic History ao clicar com ⌘.
ru: Назначьте действие правилу умного выделения в «Настройки > Профили > Дополнительные > Умное выделение > Изменить действия». Они появляются в контекстном меню и переопределяют семантическую историю при щелчке с ⌘.
zh_hans: 在“设置 > 配置文件 > 高级 > 智能选取 > 编辑操作”中为智能选取规则分配操作。这些操作会出现在上下文菜单中，通过⌘键点击可以覆盖语义历史记录。

# Tip.0031.Title
source: Smart Selection Actions
de: Aktionen der Intelligenten Auswahl
ja: スマート選択のアクション
pt_br: Ações de seleção inteligente
ru: Действия умного выделения
zh_hans: 智能选取操作

# Tip.0032.Body
source: If you want the visual bell to flash the whole screen instead of show a bell icon, you can turn that on in “Settings > Advanced.”
de: Wenn der visuelle Signalton den gesamten Bildschirm aufblitzen lassen soll, anstatt ein Glockensymbol anzuzeigen, können Sie das unter „Einstellungen > Erweitert“ aktivieren.
ja: ビジュアルベルでベルのアイコンを表示する代わりに画面全体を点滅させたい場合は、「設定 > 詳細」でオンにできます。
pt_br: Se você quiser que a campainha visual pisque a tela inteira em vez de mostrar um ícone de campainha, pode ativar isso em “Ajustes > Avançado”.
ru: Если вы хотите, чтобы визуальный сигнал вспышкой заполнял весь экран вместо показа значка колокольчика, включите это в «Настройки > Дополнительные».
zh_hans: 如果您希望视觉角标在整个屏幕上闪烁，而不是显示角标图标，可以在“设置 > 高级”中开启此功能。

# Tip.0032.Title
source: Visual Bell
de: Visueller Signalton
ja: ビジュアルベル
pt_br: Campainha visual
ru: Визуальный сигнал
zh_hans: 视觉响铃

# Tip.0033.Body
source: Right click on a tab to change its color, close tabs after it, or to close all other tabs.
de: Klicken Sie mit der rechten Maustaste auf einen Tab, um dessen Farbe zu ändern, nachfolgende Tabs zu schließen oder alle anderen Tabs zu schließen.
ja: タブを右クリックすると、色を変更したり、それ以降のタブを閉じたり、他のすべてのタブを閉じたりできます。
pt_br: Clique com o botão direito em uma aba para mudar sua cor, fechar as abas seguintes ou fechar todas as outras abas.
ru: Щёлкните правой кнопкой мыши по вкладке, чтобы изменить её цвет, закрыть вкладки после неё или закрыть все остальные вкладки.
zh_hans: 在标签页上右键点击可更改其颜色，点击后关闭该标签页，或同时关闭所有其他标签页。

# Tip.0033.Title
source: Tab Menu
de: Tab-Menü
ja: タブメニュー
pt_br: Menu da aba
ru: Меню вкладки
zh_hans: 标签页菜单

# Tip.0034.Body
source: You can assign tags to your profiles, and by clicking “Tags>” anywhere you see a list of profiles you can browse those tags.
de: Sie können Ihren Profilen Tags zuweisen. Überall dort, wo eine Liste von Profilen angezeigt wird, können Sie durch Klicken auf „Tags>“ diese Tags durchsuchen.
ja: プロファイルにタグを割り当てることができ、プロファイルの一覧が表示されている場所ならどこでも「タグ>」をクリックしてそれらのタグを閲覧できます。
pt_br: Você pode atribuir tags aos seus perfis e, ao clicar em “Tags>” em qualquer lugar onde veja uma lista de perfis, pode navegar por essas tags.
ru: Вы можете назначать теги своим профилям, а щёлкнув «Теги>» в любом списке профилей, сможете просматривать эти теги.
zh_hans: 你可以为配置文件添加标签，点击“Tags>”后，会显示所有配置文件的列表，即可浏览这些标签。

# Tip.0035.Body
source: If you put a slash in a profile’s tag, that implicitly defines a hierarchy. You can see it in the Profiles menu as nested submenus.
de: Wenn Sie in den Tag eines Profils einen Schrägstrich einfügen, wird dadurch implizit eine Hierarchie festgelegt. Diese sehen Sie im Profile-Menü als verschachtelte Untermenüs.
ja: プロファイルのタグにスラッシュを入れると、暗黙的に階層が定義されます。これはプロファイルメニューに入れ子になったサブメニューとして表示されます。
pt_br: Se você colocar uma barra na tag de um perfil, isso define implicitamente uma hierarquia. Você pode vê-la no menu Perfis como submenus aninhados.
ru: Если вставить в тег профиля косую черту, это неявно задаёт иерархию. Её можно увидеть в меню «Профили» в виде вложенных подменю.
zh_hans: 如果在配置文件的标签中加上斜杠，则隐含了层级关系。在“Profiles”菜单中可以看到嵌套的子菜单。

# Tip.0035.Title
source: Tag Hierarchy
de: Tag-Hierarchie
ja: タグの階層
pt_br: Hierarquia de tags
ru: Иерархия тегов
zh_hans: 标签层级

# Tip.0036.Body
source: iTerm2 can download files by base-64 encoding them. Click “Learn More” to download a shell script that makes it easy.
de: iTerm2 kann Dateien herunterladen, indem es sie Base64-codiert. Klicken Sie auf „Mehr erfahren“, um ein Shellskript herunterzuladen, das dies vereinfacht.
ja: iTerm2は、ファイルをBase64エンコードすることでダウンロードできます。「詳しくはこちら」をクリックすると、これを簡単にするシェルスクリプトをダウンロードできます。
pt_br: O iTerm2 pode transferir arquivos codificando-os em base-64. Clique em “Saiba mais” para transferir um shell script que facilita isso.
ru: iTerm2 может загружать файлы, кодируя их в base-64. Нажмите «Подробнее», чтобы загрузить сценарий оболочки, который упрощает этот процесс.
zh_hans: iTerm2 可以通过 Base-64 编码来下载文件。点击“了解更多”，可以下载一个 shell 脚本，方便使用。

# Tip.0037.Body
source: If you install Shell Integration, ⇧⌘; helps you complete commands. It remembers the commands you’ve run on each host that has Shell Integration installed. It knows how often that command was run and how recently to help make the best suggestions.
de: Wenn Sie die Shell-Integration installieren, hilft Ihnen ⇧⌘; beim Vervollständigen von Befehlen. Sie merkt sich die Befehle, die Sie auf jedem Host mit installierter Shell-Integration ausgeführt haben. Sie weiß, wie oft und wie kürzlich ein Befehl ausgeführt wurde, um Ihnen die besten Vorschläge zu machen.
ja: シェル統合をインストールすると、⇧⌘;がコマンド補完を助けてくれます。シェル統合をインストールした各ホストで実行したコマンドを記憶し、そのコマンドが実行された頻度と直近の実行時期をもとに、最適な候補を提案します。
pt_br: Se você instalar a Shell Integration, ⇧⌘; ajuda a completar comandos. Ela lembra os comandos que você executou em cada host que tem a Shell Integration instalada. Ela sabe com que frequência e há quanto tempo o comando foi executado para ajudar a fazer as melhores sugestões.
ru: Если вы установите «Интеграцию с оболочкой», сочетание ⇧⌘; поможет вам дополнять команды. iTerm2 запоминает команды, которые вы выполняли на каждом хосте с установленной интеграцией с оболочкой. Он знает, как часто и как недавно выполнялась команда, чтобы предлагать наилучшие варианты.
zh_hans: 如果安装 Shell Integration，⇧⌘; 可以帮助你完成命令。它会记住在安装了 Shell Integration 的每台主机上运行的命令，知道这些命令被运行的频率以及最近的时间，从而提供最佳建议。

# Tip.0037.Title
source: Command Completion
de: Befehlsvervollständigung
ja: コマンド補完
pt_br: Conclusão de comandos
ru: Автодополнение команд
zh_hans: 命令补全

# Tip.0038.Body
source: iTerm2 remembers which directories you use the most on each host that has Shell Integration installed. There’s a Toolbelt tool to browse them, and ⌥⌘/ gives you a popup sorted by frequency and recency of use.
de: iTerm2 merkt sich, welche Verzeichnisse Sie auf jedem Host mit installierter Shell-Integration am häufigsten verwenden. Im Werkzeugkasten gibt es ein Werkzeug, um diese zu durchsuchen, und ⌥⌘/ zeigt ein Popup, das nach Häufigkeit und Aktualität der Nutzung sortiert ist.
ja: iTerm2は、シェル統合をインストールした各ホストで、最もよく使うディレクトリを記憶します。それらを閲覧するツールがツールベルトにあり、⌥⌘/を押すと使用頻度と直近の使用状況で並べ替えられたポップアップが表示されます。
pt_br: O iTerm2 lembra quais diretórios você mais usa em cada host que tem a Shell Integration instalada. Há uma ferramenta na Caixa de ferramentas para navegar por eles, e ⌥⌘/ abre um pop-up ordenado por frequência e recência de uso.
ru: iTerm2 запоминает, какие каталоги вы чаще всего используете на каждом хосте с установленной интеграцией с оболочкой. Для их просмотра есть инструмент на панели инструментов, а ⌥⌘/ открывает всплывающее окно, отсортированное по частоте и давности использования.
zh_hans: iTerm2 会记录安装了 Shell Integration 的每台主机上你最常使用的目录。Toolbelt 提供了一个工具用于浏览这些目录，同时 ⌥⌘/ 可弹出按使用频率和频率排序的列表。

# Tip.0038.Title
source: Recent Directories
de: Zuletzt verwendete Verzeichnisse
ja: 最近使ったディレクトリ
pt_br: Diretórios recentes
ru: Недавние каталоги
zh_hans: 最近的目录

# Tip.0039.Body
source: If you have Shell Integration installed, you can “star” a directory to keep it always at the bottom of the Recent Directories tool in the Toolbelt. Right click and choose “Toggle Star.”
de: Wenn Sie die Shell-Integration installiert haben, können Sie ein Verzeichnis „markieren“, damit es im Werkzeug „Zuletzt verwendete Verzeichnisse“ im Werkzeugkasten immer unten angezeigt wird. Klicken Sie mit der rechten Maustaste und wählen Sie „Markierung umschalten“.
ja: シェル統合をインストールしていれば、ディレクトリに「スター」を付けて、ツールベルトの最近使ったディレクトリツールの一番下に常に表示させておくことができます。右クリックして「スターの切り替え」を選んでください。
pt_br: Se você tem a Shell Integration instalada, pode marcar um diretório com uma estrela para mantê-lo sempre na parte inferior da ferramenta Diretórios recentes na Caixa de ferramentas. Clique com o botão direito e escolha “Alternar estrela”.
ru: Если у вас установлена интеграция с оболочкой, вы можете «пометить звёздочкой» каталог, чтобы он всегда оставался внизу инструмента «Недавние каталоги» на панели инструментов. Щёлкните правой кнопкой мыши и выберите «Переключить звёздочку».
zh_hans: 如果安装了 Shell Integration，你可以给某个目录添加“星标”，这样该目录会始终出现在 Toolbelt 中“最近的目录”工具的底部。点击右键并选择“切换星标”。

# Tip.0039.Title
source: Favorite Directories
de: Bevorzugte Verzeichnisse
ja: お気に入りのディレクトリ
pt_br: Diretórios favoritos
ru: Избранные каталоги
zh_hans: 喜欢的目录

# Tip.0040.Body
source: Install Shell Integration and turn on “Settings > General > Save copy/paste and command history to disk” to remember command history per host across restarts of iTerm2.
de: Installieren Sie die Shell-Integration und aktivieren Sie „Einstellungen > Allgemein > Kopieren/Einfügen- und Befehlsverlauf auf der Festplatte speichern“, damit der Befehlsverlauf pro Host über Neustarts von iTerm2 hinweg erhalten bleibt.
ja: シェル統合をインストールし、「設定 > 一般 > コピー/ペーストとコマンド履歴をディスクに保存」をオンにすると、iTerm2を再起動してもホストごとのコマンド履歴を記憶できます。
pt_br: Instale a Shell Integration e ative “Ajustes > Geral > Salvar histórico de cópia/colagem e de comandos no disco” para lembrar o histórico de comandos por host entre reinicializações do iTerm2.
ru: Установите интеграцию с оболочкой и включите «Настройки > Общие > Сохранять историю копирования/вставки и команд на диск», чтобы запоминать историю команд для каждого хоста между перезапусками iTerm2.
zh_hans: 安装 Shell Integration 并开启“设置 > 通用 > 将复制粘贴和命令历史保存至磁盘”，以便在 iTerm2 重启时保持每台主机上的命令历史记录。

# Tip.0040.Title
source: Shell Integration History
de: Shell-Integration: Verlauf
ja: シェル統合の履歴
pt_br: Histórico do Shell Integration
ru: История интеграции с оболочкой
zh_hans: Shell 集成历史记录

# Tip.0041.Body
source: Copy a file to the pasteboard in Finder and then use “Edit > Paste Special > Paste File Base64-Encoded” for easy uploads of binary files. Use ”base64 -D” (or -d on Linux) on the remote host to decode it.
de: Kopieren Sie im Finder eine Datei in die Zwischenablage und verwenden Sie dann „Bearbeiten > Spezielles Einfügen > Datei Base64-codiert einfügen“ für einen einfachen Upload von Binärdateien. Verwenden Sie auf dem entfernten Host „base64 -D“ (unter Linux „-d“), um sie zu decodieren.
ja: Finderでファイルをコピーしてから、「編集 > 特殊なペースト > ファイルをBase64エンコードでペースト」を使うと、バイナリファイルを簡単にアップロードできます。リモートホストでは「base64 -D」(Linuxでは-d)を使ってデコードしてください。
pt_br: Copie um arquivo para a área de transferência no Finder e use “Editar > Colar especial > Colar arquivo codificado em Base64” para enviar arquivos binários com facilidade. Use “base64 -D” (ou -d no Linux) no host remoto para decodificá-lo.
ru: Скопируйте файл в буфер обмена в Finder, а затем используйте «Правка > Специальная вставка > Вставить файл в кодировке Base64» для удобной загрузки бинарных файлов. Используйте «base64 -D» (или -d в Linux) на удалённом хосте, чтобы декодировать его.
zh_hans: 在 Finder 中将文件复制到“pasteboard”，然后使用“编辑 > 粘贴特殊 > 粘贴 Base64 编码的文件”来轻松上传二进制文件。在远程主机上使用“base64 -D”（或 Linux 下的 -d）进行解码。

# Tip.0041.Title
source: Paste File as Base64
de: Datei als Base64 einfügen
ja: ファイルをBase64でペースト
pt_br: Colar arquivo como Base64
ru: Вставка файла в формате Base64
zh_hans: 以 Base64 格式粘贴文件

# Tip.0042.Body
source: You can split a tab into multiple panes with ⌘D and ⇧⌘D.
de: Sie können einen Tab mit ⌘D und ⇧⌘D in mehrere Bereiche aufteilen.
ja: ⌘Dと⇧⌘Dを使うと、タブを複数のペインに分割できます。
pt_br: Você pode dividir uma aba em vários painéis com ⌘D e ⇧⌘D.
ru: Вы можете разделить вкладку на несколько панелей с помощью ⌘D и ⇧⌘D.
zh_hans: 可以使用 ⌘D 和 ⇧⌘D 将标签页拆分为多个窗格。

# Tip.0042.Title
source: Split Panes
de: Geteilte Bereiche
ja: 分割ペイン
pt_br: Dividir painéis
ru: Разделение на панели
zh_hans: 分屏窗格

# Tip.0043.Body
source: Resize split panes with the keyboard using ^⌘-Arrow Key.
de: Passen Sie die Größe geteilter Bereiche über die Tastatur mit ^⌘-Pfeiltaste an.
ja: ^⌘と矢印キーを使うと、キーボードで分割ペインのサイズを変更できます。
pt_br: Redimensione painéis divididos pelo teclado usando ^⌘ e uma tecla de seta.
ru: Изменяйте размер разделённых панелей с клавиатуры с помощью ^⌘-стрелка.
zh_hans: 使用键盘上的 ^⌘-箭头键调整分屏窗格的大小。

# Tip.0043.Title
source: Adjust Split Panes
de: Geteilte Bereiche anpassen
ja: 分割ペインの調整
pt_br: Ajustar painéis divididos
ru: Настройка разделённых панелей
zh_hans: 调整分屏窗格
